import React from 'react'
import { Link, useHistory } from 'react-router-dom'

export const Privacy = () => {
  let history = useHistory()
  return (
    <div className="mt-5 mb-5">
      <button
        style={{
          borderRadius: '100%',
          position: 'fixed',
          left: '50px',
          top: '50px',
          paddingTop: '8px',
          paddingBottom: '12px',
        }}
        onClick={() => history.push('/registration')}
        className="btn btn-lg btn-outline-primary"
      >
        <svg
          className="bi bi-arrow-left-short"
          width="1em"
          height="1em"
          viewBox="0 0 16 16"
          fill="currentColor"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            fillRule="evenodd"
            d="M7.854 4.646a.5.5 0 0 1 0 .708L5.207 8l2.647 2.646a.5.5 0 0 1-.708.708l-3-3a.5.5 0 0 1 0-.708l3-3a.5.5 0 0 1 .708 0z"
          />
          <path
            fillRule="evenodd"
            d="M4.5 8a.5.5 0 0 1 .5-.5h6.5a.5.5 0 0 1 0 1H5a.5.5 0 0 1-.5-.5z"
          />
        </svg>
      </button>
      <div className="container">
        <h3>Политика в отношении обработки персональных данных</h3>

        <h5>1. Общие положения</h5>
        <p>
          Настоящая политика обработки персональных данных составлена в
          соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ
          «О персональных данных» и определяет порядок обработки персональных
          данных и меры по обеспечению безопасности персональных данных,
          предпринимаемые Федоровым Никитой Эдуардовичем (далее – Оператор).
        </p>
        <span>
          1.1. Оператор ставит своей важнейшей целью и условием осуществления
          своей деятельности соблюдение прав и свобод человека и гражданина при
          обработке его персональных данных, в том числе защиты прав на
          неприкосновенность частной жизни, личную и семейную тайну.
        </span>
        <br />
        <span>
          1.2. Настоящая политика Оператора в отношении обработки персональных
          данных (далее – Политика) применяется ко всей информации, которую
          Оператор может получить о посетителях веб-сайта{' '}
          <Link to="/">https://cons.learnsql.ru/</Link>.
        </span>

        <h5>2. Основные понятия, используемые в Политике</h5>
        <span>
          2.1. Автоматизированная обработка персональных данных – обработка
          персональных данных с помощью средств вычислительной техники;
        </span>
        <br />
        <span>
          2.2. Блокирование персональных данных – временное прекращение
          обработки персональных данных (за исключением случаев, если обработка
          необходима для уточнения персональных данных);
        </span>
        <br />
        <span>
          2.3. Веб-сайт – совокупность графических и информационных материалов,
          а также программ для ЭВМ и баз данных, обеспечивающих их доступность в
          сети интернет по сетевому адресу{' '}
          <Link to="/">https://cons.learnsql.ru/</Link>;
        </span>
        <br />
        <span>
          2.4. Информационная система персональных данных — совокупность
          содержащихся в базах данных персональных данных, и обеспечивающих их
          обработку информационных технологий и технических средств;
        </span>
        <br />
        <span>
          2.5. Обезличивание персональных данных — действия, в результате
          которых невозможно определить без использования дополнительной
          информации принадлежность персональных данных конкретному Пользователю
          или иному субъекту персональных данных;
        </span>
        <br />
        <span>
          2.6. Обработка персональных данных – любое действие (операция) или
          совокупность действий (операций), совершаемых с использованием средств
          автоматизации или без использования таких средств с персональными
          данными, включая сбор, запись, систематизацию, накопление, хранение,
          уточнение (обновление, изменение), извлечение, использование, передачу
          (распространение, предоставление, доступ), обезличивание,
          блокирование, удаление, уничтожение персональных данных;
        </span>
        <br />
        <span>
          2.7. Оператор – государственный орган, муниципальный орган,
          юридическое или физическое лицо, самостоятельно или совместно с
          другими лицами организующие и (или) осуществляющие обработку
          персональных данных, а также определяющие цели обработки персональных
          данных, состав персональных данных, подлежащих обработке, действия
          (операции), совершаемые с персональными данными;
        </span>
        <br />
        <span>
          2.8. Персональные данные – любая информация, относящаяся прямо или
          косвенно к определенному или определяемому Пользователю веб-сайта{' '}
          <Link to="/">https://cons.learnsql.ru/</Link>;
        </span>
        <br />
        <span>
          2.9. Пользователь – любой посетитель веб-сайта{' '}
          <Link to="/">https://cons.learnsql.ru/</Link>;
        </span>
        <br />
        <span>
          2.10. Предоставление персональных данных – действия, направленные на
          раскрытие персональных данных определенному лицу или определенному
          кругу лиц;
        </span>
        <br />
        <span>
          2.11. Распространение персональных данных – любые действия,
          направленные на раскрытие персональных данных неопределенному кругу
          лиц (передача персональных данных) или на ознакомление с персональными
          данными неограниченного круга лиц, в том числе обнародование
          персональных данных в средствах массовой информации, размещение в
          информационно-телекоммуникационных сетях или предоставление доступа к
          персональным данным каким-либо иным способом;
        </span>
        <br />
        <span>
          2.12. Трансграничная передача персональных данных – передача
          персональных данных на территорию иностранного государства органу
          власти иностранного государства, иностранному физическому или
          иностранному юридическому лицу;
        </span>
        <br />
        <span>
          2.13. Уничтожение персональных данных – любые действия, в результате
          которых персональные данные уничтожаются безвозвратно с невозможностью
          дальнейшего восстановления содержания персональных данных в
          информационной системе персональных данных и (или) уничтожаются
          материальные носители персональных данных.
        </span>
        <br />

        <h5>
          3. Оператор может обрабатывать следующие персональные данные
          Пользователя
        </h5>
        <span>3.1. Фамилия, имя, отчество;</span>
        <br />
        <span>3.2. Электронный адрес;</span>
        <br />
        <span>3.3. Номера телефонов;</span>
        <br />
        <span>3.4. учебная группа в Университете ИТМО;</span>
        <br />
        <span>
          3.5. Также на сайте происходит сбор и обработка обезличенных данных о
          посетителях (в т.ч. файлов «cookie») с помощью сервисов
          интернет-статистики (Яндекс Метрика и Гугл Аналитика и других).
        </span>
        <br />
        <span>
          3.6. Вышеперечисленные данные далее по тексту Политики объединены
          общим понятием Персональные данные.
        </span>
        <br />

        <h5>4. Цели обработки персональных данных</h5>
        <span>
          4.1. Цель обработки персональных данных Пользователя — информирование
          Пользователя посредством отправки электронных писем; предоставление
          доступа Пользователю к сервисам, информации и/или материалам,
          содержащимся на веб-сайте.
        </span>
        <br />
        <span>
          4.2. Также Оператор имеет право направлять Пользователю уведомления о
          новых продуктах и услугах, специальных предложениях и различных
          событиях. Пользователь всегда может отказаться от получения
          информационных сообщений, направив Оператору письмо на адрес
          электронной почты consultation.itmo@yandex.ru с пометкой «Отказ от
          уведомлений о новых продуктах и услугах и специальных предложениях».
        </span>
        <br />
        <span>
          4.3. Обезличенные данные Пользователей, собираемые с помощью сервисов
          интернет-статистики, служат для сбора информации о действиях
          Пользователей на сайте, улучшения качества сайта и его содержания.
        </span>
        <br />

        <h5>5. Правовые основания обработки персональных данных</h5>
        <span>
          5.1. Оператор обрабатывает персональные данные Пользователя только в
          случае их заполнения и/или отправки Пользователем самостоятельно через
          специальные формы, расположенные на сайте https://cons.learnsql.ru/.
          Заполняя соответствующие формы и/или отправляя свои персональные
          данные Оператору, Пользователь выражает свое согласие с данной
          Политикой.
        </span>
        <br />
        <span>
          5.2. Оператор обрабатывает обезличенные данные о Пользователе в
          случае, если это разрешено в настройках браузера Пользователя
          (включено сохранение файлов «cookie» и использование технологии
          JavaScript).
        </span>
        <br />

        <h5>
          6. Порядок сбора, хранения, передачи и других видов обработки
          персональных данных
        </h5>
        <p>
          Безопасность персональных данных, которые обрабатываются Оператором,
          обеспечивается путем реализации правовых, организационных и
          технических мер, необходимых для выполнения в полном объеме требований
          действующего законодательства в области защиты персональных данных.
        </p>
        <span>
          6.1. Оператор обеспечивает сохранность персональных данных и принимает
          все возможные меры, исключающие доступ к персональным данным
          неуполномоченных лиц.
        </span>
        <br />
        <span>
          6.2. Персональные данные Пользователя никогда, ни при каких условиях
          не будут переданы третьим лицам, за исключением случаев, связанных с
          исполнением действующего законодательства.
        </span>
        <br />
        <span>
          6.3. В случае выявления неточностей в персональных данных,
          Пользователь может актуализировать их самостоятельно, путем
          направления Оператору уведомление на адрес электронной почты Оператора
          consultation.itmo@yandex.ru с пометкой «Актуализация персональных
          данных».
        </span>
        <br />
        <span>
          6.4. Срок обработки персональных данных является неограниченным.
          Пользователь может в любой момент отозвать свое согласие на обработку
          персональных данных, направив Оператору уведомление посредством
          электронной почты на электронный адрес Оператора
          consultation.itmo@yandex.ru с пометкой «Отзыв согласия на обработку
          персональных данных».
        </span>
        <br />

        <h5>7. Трансграничная передача персональных данных</h5>
        <span>
          7.1. Оператор до начала осуществления трансграничной передачи
          персональных данных обязан убедиться в том, что иностранным
          государством, на территорию которого предполагается осуществлять
          передачу персональных данных, обеспечивается надежная защита прав
          субъектов персональных данных.
        </span>
        <br />
        <span>
          7.2. Трансграничная передача персональных данных на территории
          иностранных государств, не отвечающих вышеуказанным требованиям, может
          осуществляться только в случае наличия согласия в письменной форме
          субъекта персональных данных на трансграничную передачу его
          персональных данных и/или исполнения договора, стороной которого
          является субъект персональных данных.
        </span>
        <br />

        <h5>8. Заключительные положения</h5>
        <span>
          8.1. Пользователь может получить любые разъяснения по интересующим
          вопросам, касающимся обработки его персональных данных, обратившись к
          Оператору с помощью электронной почты consultation.itmo@yandex.ru.
        </span>
        <br />
        <span>
          8.2. В данном документе будут отражены любые изменения политики
          обработки персональных данных Оператором. Политика действует бессрочно
          до замены ее новой версией.
        </span>
        <br />
        <span>
          8.3. Актуальная версия Политики в свободном доступе расположена в сети
          Интернет по адресу{' '}
          <Link to="/privacy">https://cons.learnsql.ru/privacy</Link>.
        </span>
        <br />
      </div>
    </div>
  )
}
